Core/src/src/Catalogs/ВидыКартЛояльности/ВидыКартЛояльности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКартЛояльности</name>
  <attributes>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСкидкиВДисконтныхКартах</name>
    <type>
      <types>EnumRef.ВидыСкидокВДисконтныхКартах</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКарты</name>
    <type>
      <types>EnumRef.ТипыКарт</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставСкидок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоИменнаяКарта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПериода</name>
    <type>
      <types>EnumRef.ВидыПериодовДляНакопительныхСкидок</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонДисконтнойКарты</name>
    <type>
      <types>CatalogRef.ШаблоныДисконтныхКарт</types>
    </type>
  </attributes>
  <attributes>
    <name>КоэфициентПересчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПорогиНакопительныхСкидок</name>
    <attributes>
      <name>НижняяГраница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <comment>Может стоит сделать скидку процентом</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НижняяГраницаЛояльность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаЛояльность</name>
      <comment>Может стоит сделать скидку процентом</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПорогиСкидокЛояльности</name>
    <attributes>
      <name>НижняяГраница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <comment>Может стоит сделать скидку процентом</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/src/Enums/ТипыКарт/ТипыКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКарт</name>
  <enumValues>
    <name>Магнитная</name>
  </enumValues>
  <enumValues>
    <name>Штриховая</name>
  </enumValues>
  <enumValues>
    <name>Смешанная</name>
  </enumValues>
</mdclass:Enum>

Core/src/src/Catalogs/ВидыКартЛояльности/Forms/ФормаЭлемента/Module.bsl
#Область ПроцедурыИФункцииОбщегоНазначения

&НаКлиенте
// Возвращает текстовое представление интервала.
//
Функция ПолучитьПредставлениеИнтервала(ТабличнаяЧасть, ТекущаяСтрока)

	МаксНижняяГраница = Неопределено;
	СледующаяСтрока = Неопределено;
	Для Каждого СтрокаТЧ Из ТабличнаяЧасть Цикл
		Если (МаксНижняяГраница = Неопределено Или МаксНижняяГраница >= СтрокаТЧ.НижняяГраница)
		   И ТекущаяСтрока.НижняяГраница <= СтрокаТЧ.НижняяГраница
		   И СтрокаТЧ <> ТекущаяСтрока Тогда
			СледующаяСтрока = СтрокаТЧ;
			МаксНижняяГраница = СтрокаТЧ.НижняяГраница;
		КонецЕсли;
	КонецЦикла;

	Если СледующаяСтрока = Неопределено Тогда
		ПредставлениеИнтервала = СокрЛП(ТекущаяСтрока.НижняяГраница) + " " + ВалютаУчета;
	ИначеЕсли ТекущаяСтрока.НижняяГраница = СледующаяСтрока.НижняяГраница Тогда
		ПредставлениеИнтервала = "ОШИБКА: такая нижняя граница уже есть!";
	Иначе
		ПредставлениеИнтервала = СокрЛП(ТекущаяСтрока.НижняяГраница) + " - " + СокрЛП(СледующаяСтрока.НижняяГраница) + " " + ВалютаУчета;
	КонецЕсли;

	Возврат ПредставлениеИнтервала;

КонецФункции // ПолучитьПредставлениеИнтервала()

&НаКлиенте
Функция ПолучитьПредставлениеИнтервалаЛояльность(ТабличнаяЧасть, ТекущаяСтрока)

	МаксНижняяГраница = Неопределено;
	СледующаяСтрока = Неопределено;
	Для Каждого СтрокаТЧ Из ТабличнаяЧасть Цикл
		Если (МаксНижняяГраница = Неопределено Или МаксНижняяГраница >= СтрокаТЧ.НижняяГраницаЛояльность)
		   И ТекущаяСтрока.НижняяГраницаЛояльность <= СтрокаТЧ.НижняяГраницаЛояльность
		   И СтрокаТЧ <> ТекущаяСтрока Тогда
			СледующаяСтрока = СтрокаТЧ;
			МаксНижняяГраница = СтрокаТЧ.НижняяГраницаЛояльность;
		КонецЕсли;
	КонецЦикла;

	Если СледующаяСтрока = Неопределено Тогда
		ПредставлениеИнтервала = СокрЛП(ТекущаяСтрока.НижняяГраницаЛояльность) + " " + ВалютаУчета;
	ИначеЕсли ТекущаяСтрока.НижняяГраница = СледующаяСтрока.НижняяГраницаЛояльность Тогда
		ПредставлениеИнтервала = "ОШИБКА: такая нижняя граница уже есть!";
	Иначе
		ПредставлениеИнтервала = СокрЛП(ТекущаяСтрока.НижняяГраницаЛояльность) + " - " + СокрЛП(СледующаяСтрока.НижняяГраницаЛояльность) + " " + ВалютаУчета;
	КонецЕсли;

	Возврат ПредставлениеИнтервала;

КонецФункции // ПолучитьПредставлениеИнтервала()

// Процедура обновляет значение в колонке ПредставлениеИнтервала табличной части ПорогиНакопительныхСкидок.
//
&НаКлиенте
Процедура ОбновитьПредставлениеВсехСтрок()

	Для каждого ТекСтр Из Объект.ПорогиНакопительныхСкидок Цикл
		ТекСтр.ПредставлениеИнтервала = ПолучитьПредставлениеИнтервала(Объект.ПорогиНакопительныхСкидок, ТекСтр);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.ВидСкидкиВДисконтныхКартах) Тогда
		Объект.ВидСкидкиВДисконтныхКартах = ПредопределенноеЗначение("Перечисление.ВидыСкидокВДисконтныхКартах.ФиксированнаяСкидка");
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.ТипКарты) Тогда
		Объект.ТипКарты = Перечисления.ТипыКарт.Штриховая;
	КонецЕсли;	
	
	// Установка доступности цен для редактирования.
	РазрешеноРедактированиеЦенДокументов = УправлениеНебольшойФирмойУправлениеДоступомПовтИсп.РазрешеноРедактированиеЦенДокументов();
	
	ЭтаФорма.ТолькоПросмотр = НЕ РазрешеноРедактированиеЦенДокументов;
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	
	УправлениеНебольшойФирмойКлиентСервер.УстановитьКартинкуДляКомментария(Элементы.ГруппаДополнительно, Объект.Комментарий);
	
	УправлениеВидимостьюНаСервере();
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Объект.КоэфициентПересчета = 1;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ПриЧтенииНаСервере.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	УправлениеВидимостьюНаСервере();
	
КонецПроцедуры

// Процедура - обработчик события ПриОткрытии.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьПредставлениеВсехСтрок();
	
КонецПроцедуры

// Процедура - обработчик события ПослеЗаписи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьПредставлениеВсехСтрок();
	Оповестить("ПослеЗаписи_ВидыДисконтныхКарт", Объект.Комментарий, Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

// Процедура - обработчик события ПриИзменении элемента ТипКарты.
//
&НаКлиенте
Процедура ТипКартыПриИзменении(Элемент)
	
	Элементы.ШаблонДисконтнойКарты.Видимость = (Объект.ТипКарты <> ПредопределенноеЗначение("Перечисление.ТипыКарт.Штриховая"));
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода Комментарий.
//
&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	
	ПодключитьОбработчикОжидания("Подключаемый_УстановитьКартинкуДляКомментария", 0.5, Истина);
	
КонецПроцедуры // КомментарийПриИзменении()

&НаКлиенте
Процедура Подключаемый_УстановитьКартинкуДляКомментария()
	
	УправлениеНебольшойФирмойКлиентСервер.УстановитьКартинкуДляКомментария(Элементы.ГруппаДополнительно, Объект.Комментарий);
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении элемента ВидСкидкиВДисконтныхКартах.
//
&НаКлиенте
Процедура ВидСкидкиВДисконтныхКартахПриИзменении(Элемент)
	
	УправлениеВидимостьюНаСервере();
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении элемента ВидПериода.
//
&НаКлиенте
Процедура ВидПериодаПриИзменении(Элемент)
	
	ВидПериодаПриИзмененииНаСервере();
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении элемента ВидПериода (серверная часть).
//
&НаСервере
Процедура ВидПериодаПриИзмененииНаСервере()
	
	Элементы.Периодичность.Видимость = (Объект.ВидПериода <> ПредопределенноеЗначение("Перечисление.ВидыПериодовДляНакопительныхСкидок.ВесьПериод"));
	Если Не ЗначениеЗаполнено(Объект.Периодичность) И Элементы.Периодичность.Видимость Тогда
		Объект.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Год");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличнойЧасти

// Процедура - обработчик события "ПриОкончанииРедактирования" строки в ТЧ "ПорогиНакопительныхСкидок".
//
&НаКлиенте
Процедура ПорогиНакопительныхСкидокПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	// После ввода строки отсортируем ТЧ по возрастанию нижней границы.
	Объект.ПорогиНакопительныхСкидок.Сортировать("НижняяГраница");
	ОбновитьПредставлениеВсехСтрок();
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" для колонки "НижняяГраница" строки в ТЧ "ПорогиНакопительныхСкидок".
//
&НаКлиенте
Процедура ПорогиНакопительныхСкидокНижняяГраницаПриИзменении(Элемент)
	
	ТекСтрЭлемент = Элементы.ПорогиНакопительныхСкидок.ТекущиеДанные;
	ТекСтрЭлемент.ПредставлениеИнтервала = ПолучитьПредставлениеИнтервала(Объект.ПорогиНакопительныхСкидок, ТекСтрЭлемент);
	
КонецПроцедуры

//+++ Дмгг
&НаКлиенте
Процедура ПорогиСкидокЛояльностиНижняяГраницаПриИзменении(Элемент)
	
	ТекСтрЭлемент = Элементы.ПорогиНакопительныхСкидок.ТекущиеДанные;
	ТекСтрЭлемент.ПредставлениеИнтервалаЛояльность = ПолучитьПредставлениеИнтервалаЛояльность(Объект.ПорогиНакопительныхСкидок, ТекСтрЭлемент);
	
КонецПроцедуры
//--- Дмгг

// Процедура - обработчик события "ПослеУдаления" ТЧ "ПорогиНакопительныхСкидок".
//
&НаКлиенте
Процедура ПорогиНакопительныхСкидокПослеУдаления(Элемент)
	
	ОбновитьПредставлениеВсехСтрок();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииДляУправленияВнешнимВидомФормы

// Процедура отвечает за видимость элементов формы в зависимости от вида и типа дисконтной карты.
&НаСервере
Процедура УправлениеВидимостьюНаСервере()

	Если Объект.ВидСкидкиВДисконтныхКартах = ПредопределенноеЗначение("Перечисление.ВидыСкидокВДисконтныхКартах.НакопительнаяСкидка") И
		Объект.ВидПериода.Пустая() Тогда
		Объект.ВидПериода = ПредопределенноеЗначение("Перечисление.ВидыПериодовДляНакопительныхСкидок.ВесьПериод");
	КонецЕсли;
	
	Элементы.Скидка.Видимость = (Объект.ВидСкидкиВДисконтныхКартах = ПредопределенноеЗначение("Перечисление.ВидыСкидокВДисконтныхКартах.ФиксированнаяСкидка"));
	ЭтоНакопительныеСкидки = (Объект.ВидСкидкиВДисконтныхКартах = ПредопределенноеЗначение("Перечисление.ВидыСкидокВДисконтныхКартах.НакопительнаяСкидка"));
	Элементы.ПорогиНакопительныхСкидок.Видимость = ЭтоНакопительныеСкидки;
	Элементы.ВидПериода.Видимость = ЭтоНакопительныеСкидки;
	Элементы.Периодичность.Видимость = (Объект.ВидПериода <> ПредопределенноеЗначение("Перечисление.ВидыПериодовДляНакопительныхСкидок.ВесьПериод")) И ЭтоНакопительныеСкидки;
	Элементы.ШаблонДисконтнойКарты.Видимость = (Объект.ТипКарты <> ПредопределенноеЗначение("Перечисление.ТипыКарт.Штриховая"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	РС_ОбщегоНазначенияКлиент.ПроверкаМодифицированостиВопрос(Объект.Ссылка, Модифицированность, Отказ);//Паганини
КонецПроцедуры

#КонецОбласти
